this failure to converge to a stable state is not restricted to this resource by the way.

i cannot create `cloudflare_zone_dns_settings` resource that ever becomes stable.

```hcl
  # module.evernope_com.cloudflare_zone_dns_settings.default will be updated in-place
  ~ resource "cloudflare_zone_dns_settings" "default" {
      ~ internal_dns        = {
          + reference_zone_id = (known after apply)
        } -> (known after apply)
      ~ nameservers         = {
          + ns_set = (known after apply)
          ~ type   = "cloudflare.standard" -> (known after apply)
        } -> (known after apply)
      ~ soa                 = {
          ~ expire  = 604800 -> (known after apply)
          ~ min_ttl = 1800 -> (known after apply)
          + mname   = (known after apply)
          ~ refresh = 10000 -> (known after apply)
          ~ retry   = 2400 -> (known after apply)
          ~ rname   = "dns.cloudflare.com" -> (known after apply)
          ~ ttl     = 3600 -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }
```

when applying the above change, i get the following error:

```
╷
│ Error: failed to make http request
│ 
│   with module.evernope_com.cloudflare_zone_dns_settings.default,
│   on ../modules/default_zone/main.tf line 86, in resource "cloudflare_zone_dns_settings" "default":
│   86: resource "cloudflare_zone_dns_settings" "default" {
│ 
│ PATCH "https://api.cloudflare.com/client/v4/zones/95f86d19c59fb1920e229a7d45e5982a/dns_settings": 400 Bad Request
│ {"result":null,"success":false,"errors":[{"code":1001,"message":"Request body is invalid."}],"messages":[]}
╵
```

...because the provider issues a `PATCH` without a body. hence `400 Bad Request`.

but if i remove the resource from the state and recreate it, i'm back to the above diff.

on top of that, i have to set a bunch of parameters that are completely irrelevant for me:

```hcl
resource "cloudflare_zone_dns_settings" "default" {
  zone_id = cloudflare_zone.default.id

  zone_mode = var.bypass ? "dns_only" : "standard"

  # everything below this line only exists so that terraform doesn't want to keep changing these values (which i don't care about and would like to leave at their defaults)

  flatten_all_cnames = false

  foundation_dns      = false
  multi_provider      = false
  secondary_overrides = false

  ns_ttl = 86400
}
```

also, how does `flatten_all_cnames` here interact with

```hcl
resource "cloudflare_zone_setting" "cname_flattening" {
  count = var.plan == "free" ? 0 : 1
  
  zone_id    = cloudflare_zone.default.id
  setting_id = "cname_flattening"
  id         = "cname_flattening"
  value      = var.cname_flattening
  depends_on = [null_resource.zone_config_delay]
}
```

...and why do i have to specify `id` **AND** `setting_id`?

the documentation only talks about `setting_id` but if i don't supply `id`, the state keeps showing a diff

```hcl
  # module.evernope_com.cloudflare_zone_setting.cname_flattening[0] will be updated in-place
  ~ resource "cloudflare_zone_setting" "cname_flattening" {
      - id             = "cname_flattening" -> null
      + modified_on    = (known after apply)
      + time_remaining = (known after apply)
        # (4 unchanged attributes hidden)
    }
```

...which results in an error:

```
╷
│ Error: failed to make http request
│ 
│   with module.evernope_com.cloudflare_zone_setting.cname_flattening[0],
│   on ../modules/default_zone/main.tf line 319, in resource "cloudflare_zone_setting" "cname_flattening":
│  319: resource "cloudflare_zone_setting" "cname_flattening" {
│ 
│ PATCH "https://api.cloudflare.com/client/v4/zones/95f86d19c59fb1920e229a7d45e5982a/settings/cname_flattening": 400 Bad Request
│ {"success":false,"errors":[{"code":1007,"message":"Invalid value for zone setting cname_flattening"}],"messages":[],"result":null}
╵
```

furthermore, the ability to set the subscription level for a zone also never converges to a stable state.

i keep seeing

```hcl
  # module.evernope_com.cloudflare_zone_subscription.default will be updated in-place
  ~ resource "cloudflare_zone_subscription" "default" {
      ~ rate_plan  = {
          - currency           = "USD" -> null
          - externally_managed = false -> null
            id                 = "enterprise"
          - is_contract        = true -> null
          - public_name        = "Enterprise" -> null
          - sets               = [
              - "zone",
              - "is_cloudflare",
              - "public",
            ] -> null
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged attributes hidden)
    }
```

all i want to set is whether the zone is `enterprise` or `free`... which was easy to do before with

```hcl
resource "cloudflare_zone" "default" {
  account_id = var.account_id
  zone       = var.domain
  plan       = var.plan
  paused     = var.bypass
}
```

but since neither `plan` nor `paused` are supported anymore, i have to use the new resources `cloudflare_zone_dns_settings` and `cloudflare_zone_subscription`, both of which seem to be pretty broken and require specifying completely unrelated parameters that i don't want to mess with. 😞 

finally, the `cloudflare_logpush_job` resource gives me this error

```
╷
│ Error: failed to serialize http request
│ 
│   with module.evernope_com.cloudflare_logpush_job.access["s3://eq-cloudflare-logs/access/staging/evernope.com/{DATE}?region=us-east-1&sse=AES256"],
│   on ../modules/default_zone/main.tf line 151, in resource "cloudflare_logpush_job" "access":
│  151: resource "cloudflare_logpush_job" "access" {
│ 
│ Value Conversion Error An unexpected error was encountered trying to build a value. This is always an error in the provider. Please report
│ the following to the provider developer:
│ 
│ Received null value, however the target type cannot handle null values. Use the corresponding `types` package type, a pointer type or a
│ custom type that handles null values.
│ 
│ Path: 
│ Target Type: logpush_job.LogpushJobOutputOptionsModel
│ Suggested `types` Type: basetypes.ObjectValue
│ Suggested Pointer Type: *logpush_job.LogpushJobOutputOptionsModel
╵
```

when i'm trying to apply this proposed change:

```hcl
  # module.evernope_com.cloudflare_logpush_job.access["s3://eq-cloudflare-logs/access/staging/evernope.com/{DATE}?region=us-east-1&sse=AES256"] will be updated in-place
  ~ resource "cloudflare_logpush_job" "access" {
      + error_message               = (known after apply)
      ~ frequency                   = "low" -> "high"
        id                          = 52227
      ~ last_complete               = "2025-04-27T16:49:13Z" -> (known after apply)
      + last_error                  = (known after apply)
      - logpull_options             = "fields=CacheCacheStatus,CacheReserveUsed,CacheResponseBytes,CacheResponseStatus,CacheTieredFill,ClientASN,ClientCountry,ClientDeviceType,ClientIP,ClientIPClass,ClientMTLSAuthCertFingerprint,ClientMTLSAuthStatus,ClientRegionCode,ClientRequestBytes,ClientRequestHost,ClientRequestMethod,ClientRequestPath,ClientRequestProtocol,ClientRequestReferer,ClientRequestScheme,ClientRequestSource,ClientRequestURI,ClientRequestUserAgent,ClientSSLCipher,ClientSSLProtocol,ClientSrcPort,ClientTCPRTTMs,ClientXRequestedWith,ContentScanObjResults,ContentScanObjTypes,Cookies,EdgeCFConnectingO2O,EdgeColoCode,EdgeColoID,EdgeEndTimestamp,EdgePathingOp,EdgePathingSrc,EdgePathingStatus,EdgeRateLimitAction,EdgeRateLimitID,EdgeRequestHost,EdgeResponseBodyBytes,EdgeResponseBytes,EdgeResponseCompressionRatio,EdgeResponseContentType,EdgeResponseStatus,EdgeServerIP,EdgeStartTimestamp,EdgeTimeToFirstByteMs,FirewallMatchesActions,FirewallMatchesRuleIDs,FirewallMatchesSources,OriginDNSResponseTimeMs,OriginIP,OriginRequestHeaderSendDurationMs,OriginResponseBytes,OriginResponseDurationMs,OriginResponseHTTPExpires,OriginResponseHTTPLastModified,OriginResponseHeaderReceiveDurationMs,OriginResponseStatus,OriginResponseTime,OriginSSLProtocol,OriginTCPHandshakeDurationMs,OriginTLSHandshakeDurationMs,ParentRayID,RayID,RequestHeaders,ResponseHeaders,SecurityAction,SecurityActions,SecurityLevel,SecurityRuleDescription,SecurityRuleID,SecurityRuleIDs,SecuritySources,SmartRouteColoID,UpperTierColoID,WAFAction,WAFAttackScore,WAFFlags,WAFMatchedVar,WAFProfile,WAFRCEAttackScore,WAFRuleID,WAFRuleMessage,WAFSQLiAttackScore,WAFXSSAttackScore,WorkerCPUTime,WorkerStatus,WorkerSubrequest,WorkerSubrequestCount,WorkerWallTimeUs,ZoneName&timestamps=rfc3339" -> null
      + max_upload_interval_seconds = 300
      + max_upload_records          = 1000000
        name                        = "s3.access-95f86d19c59fb1920e229a7d45e5982a"
      + output_options              = {
          + cve_2021_44228   = false
          + field_names      = [
              + "CacheCacheStatus",
              + "CacheReserveUsed",
              + "CacheResponseBytes",
              + "CacheResponseStatus",
              + "CacheTieredFill",
              + "ClientASN",
              + "ClientCountry",
              + "ClientDeviceType",
              + "ClientIP",
              + "ClientIPClass",
              + "ClientMTLSAuthCertFingerprint",
              + "ClientMTLSAuthStatus",
              + "ClientRegionCode",
              + "ClientRequestBytes",
              + "ClientRequestHost",
              + "ClientRequestMethod",
              + "ClientRequestPath",
              + "ClientRequestProtocol",
              + "ClientRequestReferer",
              + "ClientRequestScheme",
              + "ClientRequestSource",
              + "ClientRequestURI",
              + "ClientRequestUserAgent",
              + "ClientSSLCipher",
              + "ClientSSLProtocol",
              + "ClientSrcPort",
              + "ClientTCPRTTMs",
              + "ClientXRequestedWith",
              + "ContentScanObjResults",
              + "ContentScanObjTypes",
              + "Cookies",
              + "EdgeCFConnectingO2O",
              + "EdgeColoCode",
              + "EdgeColoID",
              + "EdgeEndTimestamp",
              + "EdgePathingOp",
              + "EdgePathingSrc",
              + "EdgePathingStatus",
              + "EdgeRateLimitAction",
              + "EdgeRateLimitID",
              + "EdgeRequestHost",
              + "EdgeResponseBodyBytes",
              + "EdgeResponseBytes",
              + "EdgeResponseCompressionRatio",
              + "EdgeResponseContentType",
              + "EdgeResponseStatus",
              + "EdgeServerIP",
              + "EdgeStartTimestamp",
              + "EdgeTimeToFirstByteMs",
              + "FirewallMatchesActions",
              + "FirewallMatchesRuleIDs",
              + "FirewallMatchesSources",
              + "OriginDNSResponseTimeMs",
              + "OriginIP",
              + "OriginRequestHeaderSendDurationMs",
              + "OriginResponseBytes",
              + "OriginResponseDurationMs",
              + "OriginResponseHTTPExpires",
              + "OriginResponseHTTPLastModified",
              + "OriginResponseHeaderReceiveDurationMs",
              + "OriginResponseStatus",
              + "OriginResponseTime",
              + "OriginSSLProtocol",
              + "OriginTCPHandshakeDurationMs",
              + "OriginTLSHandshakeDurationMs",
              + "ParentRayID",
              + "RayID",
              + "RequestHeaders",
              + "ResponseHeaders",
              + "SecurityAction",
              + "SecurityActions",
              + "SecurityLevel",
              + "SecurityRuleDescription",
              + "SecurityRuleID",
              + "SecurityRuleIDs",
              + "SecuritySources",
              + "SmartRouteColoID",
              + "UpperTierColoID",
              + "WAFAction",
              + "WAFAttackScore",
              + "WAFFlags",
              + "WAFMatchedVar",
              + "WAFProfile",
              + "WAFRCEAttackScore",
              + "WAFRuleID",
              + "WAFRuleMessage",
              + "WAFSQLiAttackScore",
              + "WAFXSSAttackScore",
              + "WorkerCPUTime",
              + "WorkerStatus",
              + "WorkerSubrequest",
              + "WorkerSubrequestCount",
              + "WorkerWallTimeUs",
              + "ZoneName",
            ]
          + output_type      = "ndjson"
          + sample_rate      = 1
          + timestamp_format = "rfc3339"
        }
      + ownership_challenge         = (sensitive value)
        # (4 unchanged attributes hidden)
    }
```

oh, and, trying to import this resource doesn't work at all. no errors and terraform claims that the import was done. but the resource does **NOT** end up in the terraform state file. so that resource seems to be especially broken.

would you like me to open a separate issue for what i'm seeing (or even a separate issue for each resource)?

at the end of the day, the broader issue seems to be that the new provider does not converge to a stable state for many resources and requires setting parameters that _should_ be unecessary... certainly unnecessary for reaching a stable state.